package com.bins.bishi.meituan;

/**
 * @author leo-bin
 * @date 2020/3/26 19:16
 * @apiNote 第二题
 */
public class code2 {

    /**
     * 题目描述：
     * 1.一个序列是有趣的需要满足：当且仅当这个序列的每一个元素ai 满足 i 整除ai
     * 2.现在给定一个长度为n的数组，问这个数组有多少个非空的子序列是有趣的，由于答案可能比较大，只需要输出在模998244353意义下答案的就行了。
     * 3.一个长度为n的数组的非空子序列定义为从这个数组中移除至多n-1个元素后剩下的元素有序按照原顺序形成的数组。
     * 4.比如说对于数组[3,2,1]，它的非空子序列有[3],[2],[1],[3,2],[3,1],[2,1],[3,2,1]。
     * 输入
     * 第一行一个整数n表示序列的长度。(1<=n<=1e5)
     * 第二行n个整数表示给定的序列。(1<=ai<=1e6)
     * 输出
     * 输出一个数表示有趣的子序列的个数。
     * 样例输入
     * 2
     * 3 1
     * 样例输出
     * 2
     */
    public static int code1() {

        return 0;
    }

    public static void main(String[] args) {

    }
}
